Update data-model.md
